package days002;
// 클래스의 이름 : 첫글자는 반드시 영문대문자로... 두단어가 조합된 이름이라면.
// 두번째 단어의 첫글자도 대문자로 ... 
// 클래스의이름은 영문과 숫자가 조합되어 만들어질수 있습니다. 반드시 영문이 첫글자로
// 이름 중간에 공백 또는 특수기호가 들어갈수 없습니다. 
// 사용가능한 툭수기호는 언더바(_) 정도 입니다.
public class JavaThird {
// 자바 프로그램은 반드시  하나의 public  class 를 포함합니다.
	
	// 클래스내부에는 프로그램의 시작과 끝을 주관하는 public static void main()이
	// 있어야 실행이 가능합니다. 그외 클래스안에 쓰여지는 부수적인 내용은 
	// 진도가 진행됨에 따라 차례로 학습합니다
	public static void main(String[] args) {
		System.out.printf("1\t겁나 쉬운 프로그래밍~!\n");
		System.out.printf("123\t겁나 쉬운 프로그래밍~!\n");
		System.out.printf("1234\t겁나 쉬운 프로그래밍~!\n");
		// 이스케이프 문자 : 출력될 문자가 아닌 동작을 표시하는 문자
		// 주로 '\' 와 함께 쓰입니다
		// \t : Tab 의 역할
		//  -> 탭은 일정 글자수가 채워 지지 않고 사용할시, 같은 위치로 커서를 이동시킵니다
	}
}
